Repository: ridebyhorse/TicTacToe
Catalog: TicTacToe/Managers/Localizations/Localizable.xcstrings
Source language: en
Languages: ru

source: Win!
ru: Победил!

source: 30 sec
ru: 30 сек

source: 60 sec
ru: 60 сек

source: 120 sec
ru: 120 сек

source: AI
ru: ИИ

source: Back
ru: Назад

source: Choose
ru: Выберите

source: classical
ru: классика

source: Difficulty
ru: Сложность

source: Draw a grid with three rows and three columns, creating nine squares in total.
ru: Нарисуйте сетку из трёх рядов и трёх столбцов, всего девять клеток.

source: Draw!
ru: Ничья!

source: easy
ru: легко

source: en
ru: английский

source: Enter opponent name
ru: Имя оппонента

source: Enter your name
ru: Введите ваше имя

source: hard
ru: сложно

source: How to Play
ru: Правила

source: instrumentals
ru: инструментальная

source: Language
ru: Язык

source: Leaderboard
ru: Лидерборд

source: Let's play
ru: Играть

source: Music
ru: Музыка

source: nature
ru: природа

source: Next
ru: Дальше

source: No game history
ru: Нет истории игр

source: none
ru: нет

source: normal
ru: нормально

source: not so fast
ru: не так быстро

source: OK
ru: ОК

source: Picked
ru: Выбрано

source: Play again
ru: Играть заново

source: Player 1 Name
ru: Имя 1 игрока

source: Player 2 Name
ru: Имя 2 игрока

source: Player Style
ru: Стиль игры

source: Player X starts by choosing a square (e.g., square 5). Player O follows by choosing an empty square (e.g., square 1). Continue alternating turns until the game ends.
ru: Игрок X начинает, выбирая клетку (например, клетка 5). Игрок O продолжает, выбирая пустую клетку (например, клетка 1). Продолжайте чередовать ходы, пока игра не закончится.

source: Players take turns placing their marker (X or O) in an empty square. To make a move, a player selects a number corresponding to the square where they want to place their marker.
ru: Игроки по очереди ставят свои метки (X или O) в пустые клетки. Чтобы сделать ход, игрок выбирает номер, соответствующий клетке, куда он хочет поставить метку.

source: Please enter name
ru: Введите имя

source: ru
ru: русский

source: Second Player
ru: Второй игрок

source: Select Game
ru: Выберите игру

source: Settings
ru: Настройки

source: Single Player
ru: Один игрок

source: The first player to align three of their markers horizontally, vertically, or diagonally wins.Examples of Winning Combinations: Horizontal: Squares 1, 2, 3 or 4, 5, 6 or 7, 8, 9. Vertical: Squares 1, 4, 7 or 2, 5, 8 or 3, 6, 9.Diagonal: Squares 1, 5, 9 or 3, 5, 7.
ru: Первый игрок, который выстроит три свои метки по горизонтали, вертикали или диагонали, побеждает. Примеры выигрышных комбинаций: Горизонтально: Клетки 1, 2, 3 или 4, 5, 6 или 7, 8, 9. Вертикально: Клетки 1, 4, 7 или 2, 5, 8 или 3, 6, 9. Диагонально: Клетки 1, 5, 9 или 3, 5, 7"

source: TIC-TAC-TOE
ru: Крестики - Нолики

source: Time
ru: Время

source: Two Players
ru: Два игрока

source: Warning
ru: Предупреждение

source: You
ru: Вы

source: You lose!
ru: Вы проиграли!
